# По введенным пользователем координатам двух точек вывести уравнение прямой вида
# y = kx + b, проходящей через эти точки.


print('Введите координаты первой точки (два вещественных числа).')
x1 = float(input('x1: '))
y1 = float(input('y1: '))
print('Введите координаты второй точки (два вещественных числа).')
x2 = float(input('x2: '))
y2 = float(input('y2: '))

if x1 == x2:
    if y1 != y2:
        print('Не существует уравнения прямой, соответствующего условиям.')
    else:
        b = y1
        print(f'Уравнение одной из таких прямых: y = 0x + {b}')
else:
    k = (y1 - y2)/(x1 - x2)
    b = y1 - k * x1
    print(f'Уравнение прямой: y = {k}x + {b}.')